###############################################################################
###############################################################################
####                                                                       ####
#### 完成日期: 2018-06-29                                                  ####
#### 作者：Roddy Hung                                                      ####
#### 版本：V0.6                                                            ####
####                                                                       ####
#### 第2章補充範例程式:                                                    ####
####    1.R nameing的規則                                                  ####
####    2.基礎coding的常識                                                 ####
####    3.邏輯運算                                                         ####
####    4.集合運算                                                         ####
####                                                                       ####
###############################################################################
###############################################################################

################################
#這是註解
#註解很重要
show_repeat<-rep(3,5)#例如可以解釋這行意思是重複3，5次
show_repeat #所以可以幫助你解釋每一行在做甚麼
###############################
#也可以像上面這樣，幫你隔開程式，當成程式整理
a_set<-c(0.5,-3,25,78,10)
a_seq<-c(1:5)
a_set.string<-c("Hellow","everyone","!")
null_set<-NA
a_mixture<-list(a_set,a_seq,a_set.string,null_set)
#所以要養成寫註解的好習慣，因為你不能保證
#甚麼時候忘記自己寫的程式是甚麼意思
mean(sample(1:sample(1:exp(5),1), sample(1:log(1500,exp(1)),1)))

#######################################################################
logical.x <-c(T,T,F,T,T,F,T,T,F,F)
logical.y <-c(F,F,T,F,T,T,T,T,F,F)

logical.x & logical.y
logical.x | logical.y
!logical.x | logical.y

xor(logical.x,logical.y)

#######################################################################
set.x<-c(1:10)
set.y<-c(5:15)

union(set.x,set.y) #聯集
intersect(set.x,set.y) #交集
setdiff(set.x,set.y) #差集
union(setdiff(set.x,set.y), setdiff(set.y,set.x)) #補差集

#######################################################################
(set.x>5)&(set.x<=8)
# set.x>5  =>           6 7 8 9 10
# set.x<=8 => 1 2 3 4 5 6 7 8
# output   => F F F F F T T T F F

!(set.x>5)&(set.x<=8)
# !set.x>5  => 1 2 3 4 5
# set.x<=8  => 1 2 3 4 5 6 7 8
# output    => T T T T T F F F F F

(set.y>5)&(set.y<=8)
# set.y>5   =>   6 7 8 9 10 11 12 13 14 15
# set.y<=8  => 5 6 7 8 
# output    => F T T T F  F  F  F  F  F  F

(set.y>5)|(set.y<=8)
# set.y>5   =>   6 7 8 9 10 11 12 13 14 15
# set.y<=8  => 5 6 7 8 
# output    => T T T T T  T  T  T  T  T  T

!(set.y>5)|(set.y<=8)
# set.y>5   => 5   
# set.y<=8  => 5 6 7 8 
# output    => T T T T F  F  F  F  F  F  F





